Revit 2027 API
NumberingParameter.ParameterId Property
 The id of the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParameterId { get; }
Public ReadOnly Property ParameterId As ElementId
	Get
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
member ParameterId : ElementId with get
Property Value
ElementId
See Also
Reference
NumberingParameter Class
Autodesk.Revit.DB Namespace